public static void main (String[] args) {
		
		String[][][] animals ={
            {
                {"アメリカンショートヘア","マンチカン"}
                {"ジャンガリアンハムスター","ハリネズミ"}
                {"オカメインコ"    ,    "ブンチョウ"}
                {"ゴールデンレトリーバー","トイプードル"}
            }
            {
                {"アメリカンショートヘア","マンチカン"}
                {"ジャンガリアンハムスター","ハリネズミ"}
                {"オカメインコ"    ,    "ブンチョウ"}
                {"ゴールデンレトリーバー","トイプードル"}
            }
            {
                {"アメリカンショートヘア","マンチカン"}
                {"ジャンガリアンハムスター","ハリネズミ"}
                {"オカメインコ"    ,    "ブンチョウ"}
                {"ゴールデンレトリーバー","トイプードル"}
            }
            {
                {"アメリカンショートヘア","マンチカン"}
                {"ジャンガリアンハムスター","ハリネズミ"}
                {"オカメインコ"    ,    "ブンチョウ"}
                {"ゴールデンレトリーバー","トイプードル"}
            }
					};
		
	}
}